RIOT-OS/RIOT/cpu/cc13x2/radio/prop/rf_prop_internal.c
    entry               = (rfc_dataEntry_t *)sRxBuf2;
    entry->pNextEntry   = sRxBuf3;
    entry->config.lenSz = DATA_ENTRY_LENSZ_BYTE;
    entry->length       = sizeof(sRxBuf2) - sizeof(rfc_dataEntry_t);

    entry               = (rfc_dataEntry_t *)sRxBuf3;
    entry->pNextEntry   = sRxBuf0;
    entry->config.lenSz = DATA_ENTRY_LENSZ_BYTE;
    entry->length       = sizeof(sRxBuf3) - sizeof(rfc_dataEntry_t);
}

/**
 * Initialize the RX command structure.
 *
 * Sets the default values for the receive command structure.
 */
static void rfCoreInitReceiveParams(void)
{
    // clang-format off
    static const rfc_CMD_PROP_RX_ADV_t cReceiveCmd =
    {
        .commandNo                  = CMD_PROP_RX_ADV,
        .status                     = IDLE,
        .pNextOp                    = NULL,
        .startTime                  = 0u,
        .startTrigger               =
        {
            .triggerType            = TRIG_NOW,
        },
        .condition                  =
        {
            .rule                   = COND_NEVER,
        },
        .pktConf                    =
        {
            .bFsOff                 = 0,
            .bRepeatOk              = 1,
            .bRepeatNok             = 1,
            .bUseCrc                = 1,
            .bCrcIncSw              = 0,
            .bCrcIncHdr             = 0,
            .endType                = 0,
            .filterOp               = 1,
        },
        .rxConf                     =
        {
            .bAutoFlushIgnored      = 1,
            .bAutoFlushCrcErr       = 1,
            .bIncludeHdr            = 0,
            .bIncludeCrc            = 0,
            .bAppendRssi            = 1,
            .bAppendTimestamp       = 0,
            .bAppendStatus          = 1,
        },
        .syncWord0                  = 0x0055904E,
        .syncWord1                  = 0x00000000,
        .maxPktLen                  = 0,
        .hdrConf                    =
        {
            .numHdrBits             = 0x10,
            .lenPos                 = 0,
            .numLenBits             = 0x0B,
        },
        .addrConf                   =
        {
            .addrType               = 0,
            .addrSize               = 0,
            .addrPos                = 0,
            .numAddr                = 0,
        },
        .lenOffset                  = 0xFC,
        .endTrigger                 =
        {
            .triggerType            = TRIG_NEVER,
            .bEnaCmd                = 0x0,
            .triggerNo              = 0x0,
            .pastTrig               = 0x0,
        },
        .endTime                    = 0x00000000,
        .pAddr                      = 0,
        .pQueue                     = 0,
        .pOutput                    = 0
    };
    // clang-format on
    sReceiveCmd = cReceiveCmd;

    sReceiveCmd.pQueue  = &sRxDataQueue;
    sReceiveCmd.pOutput = (uint8_t *)&sRfStats;
}

/**
 * Sends the direct abort command to the radio core.
 *
 * @return The value from the command status register.
 * @retval CMDSTA_Done The command completed correctly.
 */
static uint_fast8_t rfCoreExecuteAbortCmd(void)
{
    return (RFCDoorbellSendTo(CMDR_DIR_CMD(CMD_ABORT)) & 0xFF);
}

/**
 * Sends the direct ping command to the radio core.
 *
 * Check that the Radio core is alive and able to respond to commands.
 *
 * @return The value from the command status register.
 * @retval CMDSTA_Done The command completed correctly.
 */
static uint_fast8_t rfCoreExecutePingCmd(void)
{
    return (RFCDoorbellSendTo(CMDR_DIR_CMD(CMD_PING)) & 0xFF);
}

/**
 * Sends the immediate clear rx queue command to the radio core.
 *
 * Uses the radio core to mark all of the entries in the receive queue as
 * pending. This is used instead of clearing the entries manually to avoid race
 * conditions between the main processor and the radio core.
 *
 * @param [in] aQueue A pointer to the receive queue to be cleared.
 *
 * @return The value from the command status register.
 * @retval CMDSTA_Done The command completed correctly.
 */
static uint_fast8_t rfCoreClearReceiveQueue(dataQueue_t *aQueue)
{
    /* memset skipped because sClearReceiveQueueCmd has only 2 members and padding */
    sClearReceiveQueueCmd.commandNo = CMD_CLEAR_RX;
    sClearReceiveQueueCmd.pQueue    = aQueue;

    return (RFCDoorbellSendTo((uint32_t)&sClearReceiveQueueCmd) & 0xFF);
}

/**
 * Sends the tx command to the radio core.
 *
 * Sends the packet to the radio core to be sent asynchronously.
 *
 * @note @ref aPsdu *must* be 4 byte aligned and not include the FCS.
 *
 * @param [in] aPsdu A pointer to the data to be sent.
 * @param [in] aLen  The length in bytes of data pointed to by PSDU.
 *
 * @return The value from the command status register.
 * @retval CMDSTA_Done The command completed correctly.
 */
static uint_fast8_t rfCoreSendTransmitCmd(uint8_t *aPsdu, uint8_t aLen)
{
    // clang-format off
    static const rfc_CMD_PROP_TX_ADV_t cTransmitCmd =
    {
        .commandNo                  = CMD_IEEE_TX,
        .status                     = IDLE,
        .startTrigger               =
        {
            .triggerType            = TRIG_NOW,
        },
        .condition                  = {
            .rule                   = COND_NEVER,
        },
        .pNextOp                    = NULL,
        .pktConf                    =
        {
            .bFsOff                 = 0,
            .bUseCrc                = 1,
            .bCrcIncSw              = 0,
            .bCrcIncHdr             = 0,
        },
        .numHdrBits                 = 0x10,
        .startConf                  =
        {
            .bExtTxTrig             = 0,
            .inputMode              = 0,
            .source                 = 0,
        },
        .preTrigger                 =
        {
            .triggerType            = TRIG_REL_START,
            .bEnaCmd                = 0,
            .triggerNo              = 0,
            .pastTrig               = 1,
        },
        .preTime                    = 0x00000000,
        .syncWord                   = 0x0055904E,
    };
    // clang-format on

