RIOT-OS/RIOT/cpu/cc13x2/radio/prop/rf_prop_internal.c
    if (HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) & IRQ_LAST_FG_COMMAND_DONE)
    {
        HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = ~IRQ_LAST_FG_COMMAND_DONE;

        if (_cc13x2_rf_prop_state == cc13x2_stateTransmit)
        {
            if (sTransmitCmd.pPkt[0] & IEEE802154_ACK_REQUEST)
            {
                /* XXX: ack? */
            }
            else
            {
                /* The TX command was either stopped or we are not looking for
                 * an ack */
                switch (sTransmitCmd.status)
                {
                case PROP_DONE_OK:
                    sTransmitError = 0;
                    break;

                case PROP_ERROR_NO_SETUP:
                case PROP_ERROR_NO_FS:
                    sTransmitError = -1;
                    break;

                case PROP_ERROR_TXUNF:
                    sTransmitError = -1;
                    break;

                default:
                    sTransmitError = -1;
                    break;
                }

                /* signal polling function we are done transmitting */
                sTxCmdChainDone = true;
            }
        }
    }

    if (HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) & IRQ_RX_OK) {
        sFlags |= 1;
        HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = ~IRQ_RX_OK;
    }

    if (HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) & IRQ_TX_DONE) {
        sFlags |= 2;
        _cc13x2_rf_prop_state = cc13x2_stateReceive;
        HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = ~IRQ_TX_DONE;
    }

    if (sFlags) {
        if (_irq_handler) {
            _irq_handler(_irq_handler_arg);
        }
    }
}

/**
 * Function documented in platform-cc13x2.h
 */
void cc13x2_rf_prop_init(void)
{
    /* Populate the RX parameters data structure with default values */
    rfCoreInitReceiveParams();

    _cc13x2_rf_prop_state = cc13x2_stateDisabled;
    cc26xx_cc13xx_ints.isr_rfc_cpe0 = _isr_rfc_cpe0;
    cc26xx_cc13xx_ints.isr_rfc_cpe1 = _isr_rfc_cpe1;
}

/**
 * Function documented in platform/radio.h
 */
int_fast8_t cc13x2_rf_prop_enable(void)
{
    int_fast8_t error = -1;

    if (_cc13x2_rf_prop_state == cc13x2_stateSleep)
    {
        error = 0;
    }
    else if (_cc13x2_rf_prop_state == cc13x2_stateDisabled)
    {
        if (rfCorePowerOn() != CMDSTA_Done) {
            error = -1;
            goto exit;
        }

        if (rfCoreSendEnableCmd() != PROP_DONE_OK) {
            error = -1;
            goto exit;
        }

        /* The CC1352R1_LAUNCHXL development board has an RF switch to enable
         * usage of the same antenna between the 2.4G and sub-1G RF paths. This
         * is connected to IOID 30 on the LaunchPad, and a low voltage will set
         * the switch to the 2.4G path.
         */

        /* Enable the peripheral domain for the GPIO module */
        PRCMPowerDomainOn(PRCM_DOMAIN_PERIPH);
        /* Enable the GPIO module in all power modes, this will not be turned off */
        PRCMPeripheralRunEnable(PRCM_PERIPH_GPIO);
        PRCMPeripheralSleepEnable(PRCM_PERIPH_GPIO);
        PRCMPeripheralDeepSleepEnable(PRCM_PERIPH_GPIO);
        /* Ensure the PRCM module is synced with these settings */
        PRCMLoadSet();
        /* Enable output on RF switch */
        IOCPinTypeGpioOutput(IOID_30);
        /* Set the RF Switch to the 2.4 GHz path */
        GPIO_writeDio(IOID_30, 0);

        _cc13x2_rf_prop_state = cc13x2_stateSleep;
        error  = 0;
    }

exit:

    if (error == -1)
    {
        rfCorePowerOff();
        _cc13x2_rf_prop_state = cc13x2_stateDisabled;
    }

    return error;
}

int_fast8_t cc13x2_rf_prop_disable(void)
{
    int_fast8_t error = -1;

    if (_cc13x2_rf_prop_state == cc13x2_stateDisabled)
    {
        error = 0;
    }
    else if (_cc13x2_rf_prop_state == cc13x2_stateSleep)
    {
        rfCoreSendDisableCmd();
        /* we don't want to fail if this command string doesn't work, just turn
         * off the whole core
         */
        rfCorePowerOff();
        _cc13x2_rf_prop_state = cc13x2_stateDisabled;
        error  = 0;
    }

    return error;
}

/**
 * Function documented in platform/radio.h
 */
int8_t cc13x2_rf_prop_get_txpower(void)
{
    return sCurrentOutputPower->dbm;
}

int_fast8_t cc13x2_rf_prop_set_txpower(int8_t aPower)
{
    unsigned int           i;
    output_config_t const *powerCfg = &(rgOutputPower[0]);

    for (i = 1; i < OUTPUT_CONFIG_COUNT; i++)
    {
        if (rgOutputPower[i].dbm >= aPower)
        {
            powerCfg = &(rgOutputPower[i]);
        }
        else
        {
            break;
        }
    }

    sCurrentOutputPower = powerCfg;

    return 0;
}

int_fast8_t rfSleep(void)
{
    int_fast8_t error = -1;

    if (_cc13x2_rf_prop_state == cc13x2_stateSleep)
    {
        error = 0;
    }
    else if (_cc13x2_rf_prop_state == cc13x2_stateReceive)
    {
        if (rfCoreExecuteAbortCmd() != CMDSTA_Done)
        {
            error = -1;
        }
        else
        {
            _cc13x2_rf_prop_state = cc13x2_stateSleep;
        }
    }

    return error;
}

int8_t cc13x2_rf_prop_get_rssi(void)
{
    return sRfStats.lastRssi;
}

int_fast8_t cc13x2_rf_prop_rx_start(void)
{
    int_fast8_t error = -1;

    if (_cc13x2_rf_prop_state == cc13x2_stateSleep)
    {
        _cc13x2_rf_prop_state = cc13x2_stateReceive;

        /* initialize the receive command
         * XXX: no memset here because we assume init has been called and we
         *      may have changed some values in the rx command
         */
        if (!(rfCoreSendReceiveCmd() == CMDSTA_Done)) {
            error = -1;
            goto exit;
        }
        error = 0;
    }
    else if (_cc13x2_rf_prop_state == cc13x2_stateReceive)
    {
        if (sReceiveCmd.status == ACTIVE)
        {
            /* we are already receiving */
            _cc13x2_rf_prop_state = cc13x2_stateReceive;
            error  = -1;
        }
        else
        {
            /* we have either not fallen back into our receive command or
             * we are running on the wrong channel. Either way assume the
             * caller correctly called us and abort all running commands.
             */
            if (!(rfCoreExecuteAbortCmd() == CMDSTA_Done)) {
                error = -1;
                goto exit;
            }

            /* any frames in the queue will be for the old channel */
            if (!(rfCoreClearReceiveQueue(&sRxDataQueue) == CMDSTA_Done)) {
                error = -1;
                goto exit;
            }

            if (!(rfCoreSendReceiveCmd() == CMDSTA_Done)) {
                error = -1;
                goto exit;
            }

            _cc13x2_rf_prop_state = cc13x2_stateReceive;
             error  = 0;
        }
    }

